//header:
//מספר הפריטים שבסל הקניות:
//עבור כל משתמש חדש שנכנס-אתחול מספר הפריטים הקיימים בסל הקניות שלו ב-0, ושמירה בלוקל-סטורז:
localStorage.setItem('numItemsInBag',0);

//סל הקניות:
//שמירה בלוקל סטורז מונה-עבור יצירת מפתח ייחודי עבור כל פריט שיוסף לסל הקניות. המונה מאותחל בתחילה ל-0:
localStorage.setItem('KeyForShop', 0);

//עבור כל משתמש-שמירת מערך בלוקל סטורז עבור מפתחות הפריטים שהוספו לסל. המערך ריק בהתחלה:
localStorage.setItem('ShopsKeysArr', JSON.stringify([])) //שמירה בלוקל סטורז
//JSON.stringify([]): שמירת מערך ריק. יש לבצע המרה לסטרינג-סוג הערך היחיד שמכיר הלוקל סטורז 

//----------------------------------------------------------------------------------------------------


//לצורך שימוש בפונקציה הבאה:
let wrongMessage=document.getElementById('WrongMessage'); //שמירה במשתנה את הודעת השגיאה על הסיסמה ה"מוחבאת" על-יידי הפעולה היידן

//פונקציה הבודקת האם המשתמש קיים ורשום לאתר. הפונקציה תבצע:
//1. במידה והמשתמש רשום-הפונקציה תבדוק האם הסיסמא שהוקשה על-יידי המשתמש תקינה:
//א. אם כן: הפונקציה תשמור בלוקל סטורז את שמו המלא של המשתמש-להצגתו על-יד אייקון היוזר, ותכניס את המשתמש לאתר-דרך החשבון שלו.
//ב. אם לא: תודפס על המסך הודעה מתאימה ותינתן האפשרות להקליד שוב.
//2. במידה והמשתמש אינו רשום-הפונקציה תשמור את הנתונים שהמשתמש הקליד ותעביר את המשתמש לדף הרשמה לאתר, כשהשדות ששמרה-מלאים באופן אוטומטי, ללא צורך להקליד שוב.
function enter()
{
    //לצורך ביצוע הפעולות: שמירת ערכי השדות שמולאו על-יידי המשתמש:
    let inputsArr=document.getElementsByTagName('input'); //שמירה במשתנה את מערך האינפוטים המוצגים על המסך
    let email=inputsArr[0].value; //שמירה במשתנה את הערך שהוקש על-יידי המשתמש, בתיבת הטקסט המיועדת להקשת כתובת מייל
    let password=inputsArr[1].value; //שמירה במשתנה את הערך שהוקש על-יידי המשתמש, בתיבת הטקסט המיועדת להקשת ססמא

    //בדיקה האם המשתמש קיים ורשום לאתר
    //פעולה מספר 1:
    if(localStorage.getItem(email)!=null) //במידה ותוצאת החיפוש של המייל שהוקש (=ערך ייחודי) אינה החזירה נל. כלומר-המשתמש קיים ורשום לאתר
    {
       //תת סעיף 1-א:
       //שליפה מהלוקל סטורז-בו שמורים כל פרטי היוזרים, לתוך משתנה את היוזר הרלוונטי-שכתובת המייל שלו שווה לכתובת המייל שהמשתמש הקיש
       let goodUser=JSON.parse(localStorage.getItem(email)); 
       // בקוד הנ"ל בוצעה המרה של היוזר ששלפנו מהלוקל סטורז מסטרינג-האופן בו הוא מוצג בלוקל סטורז-לאובייקט(-ג'ייסון)
       
       if(password==goodUser.Password) //במידה והססמא שהוקשה על-יידי המשתמש תואמת את הססמא של היוזר השמור באתר
       {
         //במידה וזהו נסיון שני של המשתמש להכניס ססמה-עקב ססמא שגויה שהקיש בפעם הקודמת-יש לבטל את הודעת השגיאה-על יידי הפעלת תכונת ההידן שוב
         wrongMessage.hidden=true; //הפעלת תכונת ההידן שהייתה כבויה עד עתה-בעקבות הססמא השגויה שהוקשה

         //שמירה במשתנים את השם הפרטי ואת שם המשפחה של המשתמש-על יידי שליפה מהלוקל סטורז
         let firstName=goodUser.FirstName; //שמירה במשתנה את שמו הפרטי של המשתמש-על-יידי שימוש במשתנה שהוגדר למעלה-המכיל את אובייקט היוזר
         let lastName=goodUser.LastName; //שמירה במשתנה את שם המשפחה של המשתמש-על-יידי שימוש במשתנה שהוגדר למעלה-המכיל את אובייקט היוזר
         let fullName=firstName+" "+lastName; //שמירה במשתנה את שמו המלא של היוזר-על-יידי שרשור של שמו הפרטי ושם המשפחה שלו, עם רווח ביניהם
         localStorage.setItem('FullName', fullName); //שמירת שמו המלא של המשתמש בלוקל סטורז-לצורך הצבתו על-יד אייקון היוזר בדפי האתר

         //העברת המשתמש לאתר-לדף הראשי
         window.open('../Main window/Main window.html');
        }
        
        //תת-סעיף 1-ב:
        else //במידה והססמא שהוקשה על-יידי המשתמש אינה תואמת את הססמא של היוזר השמור באתר
        {
          wrongMessage.hidden=false; //ביטול תכונת ההידן שחלה על הודעת השגיאה עד עתה  
        } 
    }

    //פעולה מספר 2:
    else //במידה ותוצאת החיפוש של המייל שהוקש (=ערך ייחודי) החזירה נל. כלומר-המשתמש אינו קיים ורשום לאתר
    {
        sessionStorage.setItem('Email', email); //שמירה זמנית-בסשן סטורז את המשתנה שהוגדר למעלה-המכיל את כתובת המייל שהמשתמש הקיש-לצורך הצבה בשדות המתאימים בדף ההרשמה
        sessionStorage.setItem('Password', password); //שמירה זמנית-בסשן סטורז את המשתנה שהוגדר למעלה-המכיל את הססמא שהמשתמש הקיש-לצורך הצבתם בשדות המתאימים בדף ההרשמה

        //העברת המשתמש לדך ההרשמה לאתר
        window.open('../Sign up window/Sign up window.html');
    }   
}
